## Workshop Homework: 

### 1. Use a generator
Answer the following questions:

Question 1: What is the sum of the outputs of the generator for limit = 5?

Question 2: What is the 13th number yielded

In [3]:
def square_root_generator(limit):
    n = 1
    while n <= limit:
        yield n ** 0.5
        n += 1

limit = 13
generator = square_root_generator(limit)

sum = 0
for sqrt_value in generator:
    print(sqrt_value)
    sum += sqrt_value

print("Sum of Generator Outputs", sum)

1.0
1.4142135623730951
1.7320508075688772
2.0
2.23606797749979
2.449489742783178
2.6457513110645907
2.8284271247461903
3.0
3.1622776601683795
3.3166247903554
3.4641016151377544
3.605551275463989
Sum of Generator Outputs 32.854555867161245

### 2. Append a generator to a table with existing data

1. Load the first generator and calculate the sum of ages of all people. Make sure to only load it once.

2. Append the second generator to the same table as the first.

3. After correctly appending the data, calculate the sum of all ages of people.

In [1]:
def people_1():
    for i in range(1, 6):
        yield {"ID": i, "Name": f"Person_{i}", "Age": 25 + i, "City": "City_A"}

for person in people_1():
    print(person)


def people_2():
    for i in range(3, 9):
        yield {"ID": i, "Name": f"Person_{i}", "Age": 30 + i, "City": "City_B", "Occupation": f"Job_{i}"}


for person in people_2():
    print(person)

{'ID': 1, 'Name': 'Person_1', 'Age': 26, 'City': 'City_A'}
{'ID': 2, 'Name': 'Person_2', 'Age': 27, 'City': 'City_A'}
{'ID': 3, 'Name': 'Person_3', 'Age': 28, 'City': 'City_A'}
{'ID': 4, 'Name': 'Person_4', 'Age': 29, 'City': 'City_A'}
{'ID': 5, 'Name': 'Person_5', 'Age': 30, 'City': 'City_A'}
{'ID': 3, 'Name': 'Person_3', 'Age': 33, 'City': 'City_B', 'Occupation': 'Job_3'}
{'ID': 4, 'Name': 'Person_4', 'Age': 34, 'City': 'City_B', 'Occupation': 'Job_4'}
{'ID': 5, 'Name': 'Person_5', 'Age': 35, 'City': 'City_B', 'Occupation': 'Job_5'}
{'ID': 6, 'Name': 'Person_6', 'Age': 36, 'City': 'City_B', 'Occupation': 'Job_6'}
{'ID': 7, 'Name': 'Person_7', 'Age': 37, 'City': 'City_B', 'Occupation': 'Job_7'}
{'ID': 8, 'Name': 'Person_8', 'Age': 38, 'City': 'City_B', 'Occupation': 'Job_8'}

In [2]:
import dlt 

# Loading first generator
generators_pipeline = dlt.pipeline(destination='duckdb', dataset_name='generators')
info = generators_pipeline.run(people_1(),
					table_name="people_dataset_1",
				    write_disposition="replace")

print(info)

Pipeline dlt_ipykernel_launcher load step completed in 0.21 seconds
1 load package(s) were loaded to destination duckdb and into dataset generators
The duckdb destination used duckdb:////Users/poojasingh/Documents/Git_Reposit/DataZoomCamp/Workshop/dlt_ipykernel_launcher.duckdb location to store data
Load package 1708148341.035261 is LOADED and contains no failed jobs

In [3]:
import duckdb
conn = duckdb.connect(f"{generators_pipeline.pipeline_name}.duckdb")

conn.sql(f"SET search_path = '{generators_pipeline.dataset_name}'")
print('Loaded tables: ')
display(conn.sql("show tables"))


print("\n\n\n people_dataset_1 Table below:")

people = conn.sql("SELECT * FROM people_dataset_1").df()
display(people)

print("\n\n\n people_dataset_1 sum of ages: ")
sum_ages = conn.sql("SELECT sum(age) FROM people_dataset_1")
display(sum_ages)

Loaded tables:

┌─────────────────────┐
│        name         │
│       varchar       │
├─────────────────────┤
│ _dlt_loads          │
│ _dlt_pipeline_state │
│ _dlt_version        │
│ people_dataset_1    │
└─────────────────────┘

 people_dataset_1 Table below:

   id      name  age    city       _dlt_load_id         _dlt_id
0   1  Person_1   26  City_A  1708148341.035261  MBMA0cQBxKXjYA
1   2  Person_2   27  City_A  1708148341.035261  Zct6XaSmgILZfg
2   3  Person_3   28  City_A  1708148341.035261  mgC8L1HzQHgk2Q
3   4  Person_4   29  City_A  1708148341.035261  K2WDOkT91l/qGA
4   5  Person_5   30  City_A  1708148341.035261  2k27lQ1VX4zEoQ

 people_dataset_1 sum of ages:

┌──────────┐
│ sum(age) │
│  int128  │
├──────────┤
│      140 │
└──────────┘

In [4]:
generators_pipeline = dlt.pipeline(destination='duckdb', dataset_name='generators')
info = generators_pipeline.run(people_2(),
					table_name="people_dataset_1",
				    write_disposition="append")
print(info)

Pipeline dlt_ipykernel_launcher load step completed in 0.16 seconds
1 load package(s) were loaded to destination duckdb and into dataset generators
The duckdb destination used duckdb:////Users/poojasingh/Documents/Git_Reposit/DataZoomCamp/Workshop/dlt_ipykernel_launcher.duckdb location to store data
Load package 1708148350.272736 is LOADED and contains no failed jobs

In [5]:
print("\n\n\n people_dataset_1 Table below:")

people = conn.sql("SELECT * FROM people_dataset_1").df()
display(people)

print("\n\n\n people_dataset_1 sum of ages: ")
sum_ages = conn.sql("SELECT sum(age) FROM people_dataset_1")
display(sum_ages)

 people_dataset_1 Table below:

    id      name  age    city       _dlt_load_id         _dlt_id occupation
0    1  Person_1   26  City_A  1708148341.035261  MBMA0cQBxKXjYA       None
1    2  Person_2   27  City_A  1708148341.035261  Zct6XaSmgILZfg       None
2    3  Person_3   28  City_A  1708148341.035261  mgC8L1HzQHgk2Q       None
3    4  Person_4   29  City_A  1708148341.035261  K2WDOkT91l/qGA       None
4    5  Person_5   30  City_A  1708148341.035261  2k27lQ1VX4zEoQ       None
5    3  Person_3   33  City_B  1708148350.272736  xZnhfteiitdsqg      Job_3
6    4  Person_4   34  City_B  1708148350.272736  hopilh4MbOb2Rg      Job_4
7    5  Person_5   35  City_B  1708148350.272736  pb6HN2pvwzkgGA      Job_5
8    6  Person_6   36  City_B  1708148350.272736  57SclGUW0SGS/w      Job_6
9    7  Person_7   37  City_B  1708148350.272736  Z5ewG5SUZqHyBQ      Job_7
10   8  Person_8   38  City_B  1708148350.272736  6kguYjokNt8BpA      Job_8

 people_dataset_1 sum of ages:

┌──────────┐
│ sum(age) │
│  int128  │
├──────────┤
│      353 │
└──────────┘

### 3. Merge a generator

Load your first generator first, and then load the second one with merge. Since they have overlapping IDs, some of the records from the first load should be replaced by the ones from the second load.

After loading, you should have a total of 8 records, and ID 3 should have age 33.

Question: Calculate the sum of ages of all the people loaded as described above.

In [6]:
generators_pipeline_2 = dlt.pipeline(destination='duckdb', dataset_name='generators')
info = generators_pipeline_2.run(people_1(),
					table_name="people_dataset_2",
				    write_disposition="replace")


print("\n\n\n people_dataset_2 Table below:")

people = conn.sql("SELECT * FROM people_dataset_2").df()
display(people)

print("\n\n\n people_dataset_1 sum of ages: ")
sum_ages = conn.sql("SELECT sum(age) FROM people_dataset_2")
display(sum_ages)

 people_dataset_2 Table below:

   id      name  age    city       _dlt_load_id         _dlt_id
0   1  Person_1   26  City_A  1708148366.551917  QPRW3+hxmM04Dg
1   2  Person_2   27  City_A  1708148366.551917  Zn9Dm7N9HC3kLw
2   3  Person_3   28  City_A  1708148366.551917  IVu73/dgZFbNog
3   4  Person_4   29  City_A  1708148366.551917  /RHeOb34tXO3ig
4   5  Person_5   30  City_A  1708148366.551917  2hTx3TyawJvmXQ

 people_dataset_1 sum of ages:

┌──────────┐
│ sum(age) │
│  int128  │
├──────────┤
│      140 │
└──────────┘

In [7]:

generators_pipeline_2 = dlt.pipeline(destination='duckdb', dataset_name='generators')
info = generators_pipeline_2.run(people_2(),
					table_name="people_dataset_2",
				    write_disposition="merge",
                    primary_key='id')
print(info)


print("\n\n\n people_dataset_2 Table below:")

rides = conn.sql("SELECT * FROM people_dataset_2").df()
display(rides)

print("\n\n\n people_dataset_2 sum of ages: ")
sum_ages = conn.sql("SELECT sum(age) FROM people_dataset_2")
display(sum_ages)

Pipeline dlt_ipykernel_launcher load step completed in 0.29 seconds
1 load package(s) were loaded to destination duckdb and into dataset generators
The duckdb destination used duckdb:////Users/poojasingh/Documents/Git_Reposit/DataZoomCamp/Workshop/dlt_ipykernel_launcher.duckdb location to store data
Load package 1708148377.082809 is LOADED and contains no failed jobs



 people_dataset_2 Table below:

   id      name  age    city       _dlt_load_id         _dlt_id occupation
0   1  Person_1   26  City_A  1708148366.551917  QPRW3+hxmM04Dg       None
1   2  Person_2   27  City_A  1708148366.551917  Zn9Dm7N9HC3kLw       None
2   4  Person_4   34  City_B  1708148377.082809  m5t5p/hWoTOL8g      Job_4
3   3  Person_3   33  City_B  1708148377.082809  jotZK5JcC8Bu0Q      Job_3
4   6  Person_6   36  City_B  1708148377.082809  dz0+o65Niqde0Q      Job_6
5   8  Person_8   38  City_B  1708148377.082809  vRQY6gODnNm7pQ      Job_8
6   5  Person_5   35  City_B  1708148377.082809  1PFWStnh25QrUA      Job_5
7   7  Person_7   37  City_B  1708148377.082809  w26AE54kXcnYjA      Job_7

 people_dataset_2 sum of ages:

┌──────────┐
│ sum(age) │
│  int128  │
├──────────┤
│      266 │
└──────────┘